{
    "lore": [
        "Ah! te voilà",
        "Alors je sais que tu n'est que stagière mais aujourd'hui, c'est toi qui va travailler a ma place (mais je te guiderais ne t'inquiète pas)",
        "On doit regarder si un site d'hébergeur a des failles de sécurité"
    ],
    "start": [
        "Pour cela, on doit trouver les ports ouvert et qui pourrons donc nous permettre d'entrer",
        "Nous allons donc utiliser la commande `nmap` pour scanner les ports ouvert.",
        "vas-y, utilise la:"
    ],
    "nmaptest": [
        "Ah oui c'est vrai ! J'ai oublier de te donner l'ip du server...",
        "Tiens, c'est `127.0.0.1`, maintenant tu peux y aller."
    ],
    "nmap": [
        "Comme tu peux le voir, il n'y a qu'un seul port d'ouvert : le port 80.",
        "Il est habituellement utilisé pour les server web donc on peut regarder si le server n'a pas un site internet !",
        "Il en a un ! http://127.0.0.1/.",
        "Je te laisser regarder, dit moi si tu trouve quelque chose d'intéressant !"
    ],
    "loginpage": [
        "Tiens, tiens...",
        "On a quelque chose d'intéressant ici !",
        "Par contre on ne peut pas se créer de compte...",
        "Mais la plupart du temps, le SQL est utilisé pour les connections/inscriptions.",
        "Comme on a rien d'autre essayons de se créer un compte avec cette faille.",
        "On verra ensuite quoi faire !"
    ],
    "sqltest": [
        "Pour voir si le site utilise du SQL, on peut tout simplement utiliser les commentaire SQL et voir si cela nous donne un message d'erreur car cela va rendre la requête invalide",
        "Vas-y met les commentaire dans le nom d'utilisateur.",
        "Ah oui, les commentaire en SQL c'est `--` !"
    ],
    "faillesql": [
        "Super ! ça marche !",
        "Maintenant créons nous un nouvel utilisateur !",
        "Le mot de passe sera `abcd1234` et le nom `toto` comme ça on ne risque pas de l'oublier...",
        "Voilà la commande : `INSERT INTO users VALUES ('toto', 'abcd1234', 0, 100)` !",
        "Avec cette commande on va rajouter dans la table `users` une ligne avec comme nom `toto`, comme mot de passe `abcd1234`, comme permission 0 donc administrateur et en id 100."
    ],
    "usercreated": [
        "bien joué !",
        "maintenant essayons de se connecter avec nos propre identifiant (`toto` et `abcd1234`)."
    ],
    "user": [
        "bon, maintenant qu'est ce qu'on fait ?",
        "A j'ai peut-être une idée !",
        "comme tu peux le voir, on peux changer son avatar.",
        "Et si a la place de mettre une image on envoyait un fichier .php ?"
    ],
    "nc": [
        "Avant d'établir un reverse shell qui nous permettra d'exécuter des commande sur leur serveur,",
        "Nous devons prévenir notre ordinateur pour lui dire d'écouter pour voir si un ordinateur nous demande d'exécuter des commande à sa place.",
        "Tu dois donc faire la commande `nc -l 5555` pour lui dire d'écouter sur le port 5555."
    ],
    "reverse" :[
        "Super, maintenant il ne reste plus qu'à uploader notre petit fichier php.",
        "Tiens, j'en ai préparé un : <a href='../exploit.php' download>exploit.php</a>",
        "à la place de mettre une image pour la photo de profil de ce compte met ce petit fichier fait maison..."
    ],
    "shell" : [
        "Bien joué !",
        "Félicitation on a réussi à s'infiltrer !"
    ]
}